{
  "movies": [
{
      "id": "1",
      "type": "Film",
      "title": "Batman: The Movie",
      "director": "Leslie H. Martinson",
      "year": "1966",
      "rating":"6.5/10",
      "star": "Burt Ward",
      "reviews": "",
      "about": "Batman and Robin try to rescue Commodore Schmidlapp who they think is in danger, but it turns out to be a trap set by four villains in Gotham City. The villains use a device that can turn humans into dust and escape in a submarine. Catwoman pretends to help Batman and Robin, but they discover that she's actually a villain. The villains also kidnap the United World Organization's Security Council, and Batman and Robin have to fight to get them back. In the end, Batman and Robin are successful in saving the Security Council, but they find that each council member now displays the mannerisms of a different nation. Batman and Robin hope that this strange mixing of minds does more good than harm.",
      "cast": "Adam West, Burt Ward, Lee Meriwether, Cesar Romero, Burgess Meredith, Frank Gorshin",
      "image": "https://m.media-amazon.com/images/M/MV5BMmM1OGIzM2UtNThhZS00ZGNlLWI4NzEtZjlhOTNhNmYxZGQ0XkEyXkFqcGdeQXVyNTkxMzEwMzU@._V1_.jpg"
      },
      {
      "id": "2",
      "type": "Film",
      "title": "Batman",
      "director": "Tim Burton",
      "year": "1989",
      "rating":"7.5/10",
      "star": "Michael Keaton",
      "reviews": "",
      "about": "Batman is a 1989 superhero film based on the DC Comics character created by Bob Kane and Bill Finger. It was directed by Tim Burton and starred Jack Nicholson, Michael Keaton, and Kim Basinger. The movie takes place early in Batman's crime-fighting career and features his conflict with his nemesis, the Joker. The film was successful both critically and financially, receiving numerous award nominations and spawning three sequels. It also influenced the marketing and development techniques of the superhero film genre.",
      "cast": "Jack Nicholson, Michael Keaton, Kim Basinger, Robert Wuhl, Pat Hingle, Billy Dee Williams, Michael Gough, Jack Palance",
      "image": "https://m.media-amazon.com/images/M/MV5BZDNjOGNhN2UtNmNhMC00YjU4LWEzMmUtNzRkM2RjN2RiMjc5XkEyXkFqcGdeQXVyMTU0OTM5ODc1._V1_.jpg"
      },
    {
      "id": "3",
      "title": "Batman Returns",
      "director": "Tim Burton",
      "year": "1992",
      "rating": "7.1/10",
      "star": "Michael Keaton",
      "reviews": "",
      "about": "Batman Returns is a 1992 superhero film directed by Tim Burton and written by Daniel Waters. It is a sequel to the 1989 Batman film and features Batman battling the wealthy industrialist Max Shreck and the deformed crime boss Oswald Cobbleplot / The Penguin, while also dealing with Selina Kyle, who becomes Catwoman. The film was made with a $50 million budget, primarily using practical effects and makeup, and was released on June 19, 1992. Although it was a box-office success, it failed to replicate the success of its predecessor, partly because of its darker tone and violent or sexual elements. The film received mixed reviews, with criticism aimed at its tone and narrative, but praise for the cast. After Batman Returns, Burton was replaced as director, and the series took a family-friendly direction. However, Batman Returns has since been reassessed as one of the best Batman films, and Keaton will reprise his role as Batman in an upcoming film.",
      "cast": "Michael Keaton, Danny DeVito, Michelle Pfeiffer, Christopher Walken, Michael Gough, Pat Hingle, Michael Murphy",
      "image": "https://m.media-amazon.com/images/M/MV5BOGZmYzVkMmItM2NiOS00MDI3LWI4ZWQtMTg0YWZkODRkMmViXkEyXkFqcGdeQXVyODY0NzcxNw@@._V1_FMjpg_UX1000_.jpg"
    },
    {
      "id": "4",
      "title": "Batman Forever",
      "director": "Joel Schumacher",
      "year": "1995",
      "rating": "5.4/10",
      "star": "Val Kilmer",
      "reviews": "",
      "about": "Batman stops Two-Face's hostage situation after being disfigured by acid. Wayne Enterprises' employee, Nygma, invents a device that can beam TV signals into the brain, but Bruce fears the technology's manipulation. Nygma resigns and becomes the Riddler, partnering with Two-Face to finance the mass-production of the Box a brainwave device that makes Nygma smarter. They destroy the Batcave, but Batman rescues his love interest and his partner. Two-Face falls to his death after Batman distracts him. Nygma is admitted to Arkham Asylum, where he delusionally proclaims to be Batman. Bruce resumes his superhero duty with Robin as his partner.",
      "cast": "Val Kilmer, Tommy Lee Jones, Jim Carrey, Nicole Kidman, Chris O'Donnell, Michael Gough, Pat Hingle",
      "image": "https://m.media-amazon.com/images/M/MV5BNDdjYmFiYWEtYzBhZS00YTZkLWFlODgtY2I5MDE0NzZmMDljXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_FMjpg_UX1000_.jpg"
    },
    {
      "id": "5",
      "title": "Batman and Robin",
      "director": "Joel Schumacher",
      "year": "1997",
      "rating": "3.7/10",
      "star": "George Clooney",
      "reviews": "",
      "about": "Batman and Robin fight Mr. Freeze, who has stolen diamonds and frozen Robin. They discover that Freeze is actually a scientist who was trying to cure his wife's illness, but an accident caused him to need to live in a cryogenic suit. Meanwhile, Poison Ivy is created when a botanist is mutated by toxins, and she joins forces with Bane to steal money from Wayne Enterprises. They plan to freeze all of humanity and repopulate the earth with Ivy's mutant plants. Robin gets seduced by Ivy, causing tension between him and Batman. However, they are joined by Alfred's niece, Barbara, who becomes Batgirl and helps them defeat Ivy and Freeze, who is later offered the chance to continue his research in exchange for his cure.",
      "cast": "Arnold Schwarzenegger, George Clooney, Chris O'Donnell, Uma Thurman, Alicia Silverstone, Michael Gough, Pat Hingle, Elle Macpherson",
      "image": "https://m.media-amazon.com/images/M/MV5BMGQ5YTM1NmMtYmIxYy00N2VmLWJhZTYtN2EwYTY3MWFhOTczXkEyXkFqcGdeQXVyNTA2NTI0MTY@._V1_FMjpg_UX1000_.jpg"
    },
    {
      "id": "6",
      "title": "Batman Begins",
      "director": "Christopher Nolan",
      "year": "2005",
      "rating": "8.2/10",
      "star": "Chistian Bale",
      "reviews": "",
      "about": "Young Bruce Wayne falls into a well and develops a fear of bats. His parents take him to an opera where he becomes scared of performers in bat costumes. Afterwards, his parents are killed by a mugger, leaving Bruce to be raised by his butler. Years later, Bruce plans to avenge his parents' deaths by killing their murderer, but he is killed by someone else first. Bruce trains in combat and joins the League of Shadows but leaves them when he disagrees with their plan to destroy Gotham. Bruce returns to Gotham and takes on the identity of Batman. He works with Rachel, an assistant district attorney, and Sergeant Gordon, a honest cop, to take down the criminal underworld, including mafia boss Falcone and corrupt psychologist Crane. Batman confronts the League's true leader, Ra's al Ghul, who plans to destroy Gotham with a microwave emitter. Batman saves the city and gains Rachel's respect but she cannot be with him while he is Batman. Batman becomes a public hero, takes control of Wayne Enterprises, and promises to continue fighting crime.",
      "cast": "Christian Bale, Michael Caine, Liam Neeson, Katie Holmes, Gary Oldman, Cillian Murphy, Tom Wilkinson, Rutger Hauer, Ken Watanabe, Morgan Freeman,"
      "image": "https://m.media-amazon.com/images/M/MV5BOTY4YjI2N2MtYmFlMC00ZjcyLTg3YjEtMDQyM2ZjYzQ5YWFkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_FMjpg_UX1000_.jpg"
    },
    {
      "id": "7",
      "title": "The Dark Knight",
      "director": "Christopher Nolan",
      "year": "2008",
      "rating": "9/10",
      "star": "Chistian Bale",
      "reviews": "",
      "about": "",
      "cast": "",
      "image": "https://m.media-amazon.com/images/M/MV5BMTMxNTMwODM0NF5BMl5BanBnXkFtZTcwODAyMTk2Mw@@._V1_FMjpg_UX1000_.jpg"
    },
    {
      "id": "8",
      "title": "The Dark Knight Rises",
      "director": "Christopher Nolan",
      "year": "2012",
      "rating": "8.4/10",
      "star": "Chistian Bale",
      "reviews": "",
      "about": "",
      "cast": "",
      "image": "https://m.media-amazon.com/images/M/MV5BMTk4ODQzNDY3Ml5BMl5BanBnXkFtZTcwODA0NTM4Nw@@._V1_FMjpg_UX1000_.jpg"
    },
    {
      "id": "9",
      "title": "Batman v Superman: Dawn of Justice",
      "director": "Zack Snyder",
      "year": "2016",
      "rating": "6.4/10",
      "star": "Ben Affleck",
      "reviews": "",
      "about": "",
      "cast": "",
      "image": "https://cdn11.bigcommerce.com/s-ydriczk/images/stencil/1280x1280/products/87632/89085/Batman_V_Superman_Dawn_Of_Justice_Regular_Style_buy_original_movie_posters_at_starstills__12588.1456936452.jpg?c=2"
    },
    {
      "id": "10",
      "title": "The Lego Batman Movie",
      "director": "Chris McKay",
      "year": "2017",
      "rating": "7.3/10",
      "star": "Will Arnett",
      "reviews": "",
      "about": "",
      "cast": "",
      "image": "https://m.media-amazon.com/images/M/MV5BMTcyNTEyOTY0M15BMl5BanBnXkFtZTgwOTAyNzU3MDI@._V1_FMjpg_UX1000_.jpg"
    },
    {
      "id": "11",
      "title": "The Batman",
      "director": "Matt Reeves",
      "year": "2022",
      "rating": "7.8/10",
      "star": "Robert Pattinson",
      "reviews": "",
      "about": "",
      "cast": "",
      "image": "https://m.media-amazon.com/images/M/MV5BYTExZTdhY2ItNGQ1YS00NjJlLWIxMjYtZTI1MzNlMzY0OTk4XkEyXkFqcGdeQXVyMTEyMjM2NDc2._V1_.jpg"
    }
  ]
}